marmbrus/circuits/roomsensor/src/sdkconfig.defaults
# This config is ignored
# Run idf.py set-target esp32s2
# CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# Enable RAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# mbedTLS memory and buffer tuning for OTA in low internal RAM
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n